In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
df['col2'].nunique()
# returns the length of the array in coln which do not have anything in common

3

In [9]:
df['col2'].value_counts() # retuns the number of times the item is present

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
df[df['col1']>2] # returns a dataframe 
# which has the value greater than 2 in col1

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [16]:
df[(df['col1']>0) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [21]:
def myfunc(x):
    return x*2
df['col1'].apply(myfunc) 
# if you want to multiply the data frame with a custom function 
# or a user defined function then use the apply method
# and as an argument pass in the function name only

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
# you can add built in functions also that can be used such as
# if you want to find the length of each string in a given dataframe,
df['col3'].apply(len) 
# this will return the length of each string in the given dataframe

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
# using apply on lambda functions
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
# removing columns 
df.drop('col1',axis = 1)
# the drop command wil drop the column based on its name 
# and axis = 1 will define the column is delete  
# and inplace = True will make changes in the original array

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [34]:
df.columns # returns the name of the columns in a list
df.index =  ['a','b','c','d'] # will add one more index in rows
df.rows # returns an array of row headings

['a', 'b', 'c', 'd']

In [42]:
df.sort_values('col2') 
# will sort according to the column data and index remains attached to the row

   col1  col2 col3
a     1   444  abc
d     4   444  xyz
b     2   555  def
c     3   666  ghi

In [46]:
df.sort_values('col1')

   col1  col2 col3
a     1   444  abc
b     2   555  def
c     3   666  ghi
d     4   444  xyz

In [50]:
df1 = pd.DataFrame({
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','x','x','y','y','y'],
    'D':[1,3,2,5,4,1]
})

In [54]:
df1.pivot_table(values = 'D',index = ['A','B'],columns= 'C')
# values to be organized is the value command
# indexing based on values and can be accessed and it becomes multi level indexing
# the columns that are created are based on common names in x and y columns
# the NaN returned is because of missing data in the dataframe

C          x    y
A   B
bar one  NaN  2.5
    two  NaN  5.0
foo one  2.0  NaN
    two  2.0  NaN